{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Clinical Reports",
    "1": "Comment/Editorial",
    "2": "Communication",
    "3": "Contact Tracing",
    "4": "Diagnostics",
    "5": "Drug Targets",
    "6": "Education",
    "7": "Effect on Medical Specialties",
    "8": "Forecasting & Modelling",
    "9": "Health Policy",
    "10": "Healthcare Workers",
    "11": "Imaging",
    "12": "Immunology",
    "13": "Inequality",
    "14": "Infection Reports",
    "15": "Long Haul",
    "16": "Medical Devices",
    "17": "Meta-analysis",
    "18": "Misinformation",
    "19": "Model Systems & Tools",
    "20": "Molecular Biology",
    "21": "News",
    "22": "Non-human",
    "23": "Non-medical",
    "24": "Pediatrics",
    "25": "Prevalence",
    "26": "Prevention",
    "27": "Psychology",
    "28": "Recommendations",
    "29": "Review",
    "30": "Risk Factors",
    "31": "Surveillance",
    "32": "Therapeutics",
    "33": "Transmission",
    "34": "Vaccines"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Clinical Reports": 0,
    "Comment/Editorial": 1,
    "Communication": 2,
    "Contact Tracing": 3,
    "Diagnostics": 4,
    "Drug Targets": 5,
    "Education": 6,
    "Effect on Medical Specialties": 7,
    "Forecasting & Modelling": 8,
    "Health Policy": 9,
    "Healthcare Workers": 10,
    "Imaging": 11,
    "Immunology": 12,
    "Inequality": 13,
    "Infection Reports": 14,
    "Long Haul": 15,
    "Medical Devices": 16,
    "Meta-analysis": 17,
    "Misinformation": 18,
    "Model Systems & Tools": 19,
    "Molecular Biology": 20,
    "News": 21,
    "Non-human": 22,
    "Non-medical": 23,
    "Pediatrics": 24,
    "Prevalence": 25,
    "Prevention": 26,
    "Psychology": 27,
    "Recommendations": 28,
    "Review": 29,
    "Risk Factors": 30,
    "Surveillance": 31,
    "Therapeutics": 32,
    "Transmission": 33,
    "Vaccines": 34
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "type_vocab_size": 2,
  "vocab_size": 30522
}
